slawfik/akcelerometerr/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define SOPT5_UART0RXSRC_UART_RX 0x00u /*!<@brief UART0 receive data source select: UART0_RX pin */
#define SOPT5_UART0TXSRC_UART_TX 0x00u /*!<@brief UART0 transmit data source select: UART0_TX pin */

/*! @name PORTA2 (number 28), J1[4]/D1/UART0_TX
  @{ */
#define BOARD_INITPINS_DEBUG_UART_TX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_DEBUG_UART_TX_PIN 2U     /*!<@brief PORTA pin index: 2 */
                                                /* @} */

/*! @name PORTA1 (number 27), J1[2]/D0/UART0_RX
  @{ */
#define BOARD_INITPINS_DEBUG_UART_RX_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_DEBUG_UART_RX_PIN 1U     /*!<@brief PORTA pin index: 1 */
                                                /* @} */

/*! @name PORTB18 (number 53), D3[1]/LEDRGB_RED
  @{ */
#define BOARD_INITPINS_LED_RED_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_RED_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_RED_PIN 18U    /*!<@brief PORTB pin index: 18 */
                                          /* @} */

/*! @name PORTE24 (number 24), U7[4]/I2C0_SCL
  @{ */
#define BOARD_INITPINS_ACCEL_SCL_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_ACCEL_SCL_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_ACCEL_SCL_PIN 24U    /*!<@brief PORTE pin index: 24 */
                                            /* @} */

/*! @name PORTE25 (number 25), U7[6]/I2C0_SDA
  @{ */
#define BOARD_INITPINS_ACCEL_SDA_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_ACCEL_SDA_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_INITPINS_ACCEL_SDA_PIN 25U    /*!<@brief PORTE pin index: 25 */
                                            /* @} */

/*! @name PORTB16 (number 51), TSI0_CH9
  @{ */
#define BOARD_INITPINS_TSI_ELECTRODE_1_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_TSI_ELECTRODE_1_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_TSI_ELECTRODE_1_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                                  /* @} */

/*! @name PORTB17 (number 52), TSI0_CH10
  @{ */
#define BOARD_INITPINS_TSI_ELECTRODE_2_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_TSI_ELECTRODE_2_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_TSI_ELECTRODE_2_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                                  /* @} */

/*! @name PORTB19 (number 54), D3[4]/LEDRGB_GREEN
  @{ */
#define BOARD_INITPINS_LED_GREEN_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_INITPINS_LED_GREEN_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_INITPINS_LED_GREEN_PIN 19U    /*!<@brief PORTB pin index: 19 */
                                            /* @} */

/*! @name PORTA14 (number 34), U7[11]/INT1_ACCEL
  @{ */
#define BOARD_INITPINS_ACCEL_INT1_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ACCEL_INT1_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ACCEL_INT1_PIN 14U    /*!<@brief PORTA pin index: 14 */
                                             /* @} */

/*! @name PORTA15 (number 35), U7[9]/INT2_ACCEL
  @{ */
#define BOARD_INITPINS_ACCEL_INT2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_ACCEL_INT2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_ACCEL_INT2_PIN 15U    /*!<@brief PORTA pin index: 15 */
                                             /* @} */

/*! @name PORTA18 (number 40), Y1[3]/EXTAL
  @{ */
#define BOARD_INITPINS_EXTAL0_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_EXTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_EXTAL0_PIN 18U    /*!<@brief PORTA pin index: 18 */
                                         /* @} */

/*! @name PORTA19 (number 41), Y1[1]/XTAL
  @{ */
#define BOARD_INITPINS_XTAL0_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_INITPINS_XTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_INITPINS_XTAL0_PIN 19U    /*!<@brief PORTA pin index: 19 */
                                        /* @} */

/*! @name PORTD1 (number 74), J2[12]/D3[3]/D13/LEDRGB_BLUE
  @{ */
#define BOARD_INITPINS_LED_BLUE_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_INITPINS_LED_BLUE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_INITPINS_LED_BLUE_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
